<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"da0a80ddd226334fe0b17a746f331efa10e0e7ba70be2b502c038afe30bb7f4b","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #897 at https://github.com/cal-itp/data-infra/actions/runs/19050200000","plan_out_hash":"670ba989175d4f22fd2cec42ad58e6c02abc44c3ea89a5d24ddee2338e6c040b","plan_hash":"9853ef097e201633b34396558db6ce78f02003ab7a53a8f484b86cdde676d8a5","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["plugins/operators/dbt_bigquery_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "ExLWlg==" -> (known after apply)
!~      detect_md5hash      = "HZtToOT6X6AIT89543LQrw==" -> "different hash"
!~      generation          = 1761173149626911 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/dbt_bigquery_to_gcs_operator.py"
!~      md5hash             = "HZtToOT6X6AIT89543LQrw==" -> (known after apply)
        name                = "plugins/operators/dbt_bigquery_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #897](https://github.com/cal-itp/data-infra/actions/runs/19050200000)